clear
h=1;      %时间步长为1
s0=2;      %初始含盐2kg
w0=2000;     %初始水池有水2000m3
r0=s0/w0;      %初始浓度
s(1)=s0+0.5*6*h-4*h*r0;  %一分钟后的含盐量
w(1)=w0+2*h;             %一分钟后水池中的盐水体积
r(1)=s(1)/w(1);             %一分钟后的浓度 
t(1)=h;
y(1)=(2000000+3000000*h+3000*h^2+h^3)/(1000+h)^2;
for i=2:200
    t(i)=i*h; 
    s(i)=s(i-1)+0.5*6*h-4*h*r(i-1);  %第i步后的含盐量
    w(i)=w(i-1)+2*h;                %第i步后的盐水体积
    r(i)=s(i)/w(i);                      %第i步后的盐水浓度
    y(i)=(2000000+3000000*t(i)+3000*t(i)^2+t(i)^3)/(1000+t(i))^2; 
    m=floor(i/10);  
    if i/10-m<0.1  
        tm(m)=m;
        wm(m)= w(i);
        sm(m)=s(i);
        rm(m)=r(i);
    end
    if r(i)>0.2   %若第i步后的盐水浓度大于0.2
          t02=i*h;
          r02=r(i);
          break 
    end
end
[t02,r02]
[10*tm',sm',rm']       % '表示逆
subplot(1,2,1),plot(t,s,'blue');
hold on
subplot(1,2,2),plot(t,y,'red');
