function example7_2()
%7.1.3.2人口增长模型
%求解Malthus模型和Logistic模型，预测美国人口数量

k=197.273;                               %xm=197.273
r=0.03134;                                % r=0.03134
t=0:10:160;                               %时间间隔为10年
n0=3.929;
n1=[3.929 5.308 7.240 7.638 12.866 17.069 23.192 31.443 38.558 50.156 62.948 75.995 91.972 105.711 122.775 131.669 150.697];% 实际统计资料
n2=n0*exp(r*t);                             % Malthus模型
n3=k./(1+((k/n0)-1).*exp(-r.*t));                %Logistic模型
t=t+1790;
plot(t,n1,'k*-',t,n2,'go-',t,n3)
